NCE2/L25 Do the English speak English.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-06 Tue 22:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="DESKTOP-13B7HQM" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-orga409e7c" class="outline-2">
<h2 id="orga409e7c">Lesson 25 Do the English speak English?</h2>
<div class="outline-text-2" id="text-orga409e7c">
<p class="verse">
Why does the writer not understand the porter?<br />
<br />
I arrived in London at last.<br />
The railway station was big, black and dark.<br />
I did <b>not know the way to my hotel</b>,<br />
&#xa0;so I asked a porter.<br />
I not only spoke English very carefully, but very clearly as well.<br />
The porter, however, could not understand me.<br />
I repeated my question several times<br />
&#xa0;and at last he understood.<br />
He answered me,<br />
&#xa0;but he spoke neither slowly nor clearly.<br />
'I am a foreigner,' I said.<br />
Then he spoke slowly,<br />
&#xa0;but I could not understand him.<br />
My teacher never spoke English like that!<br />
The porter and I looked at each other and smiled.<br />
Then he said somethings and I understood it.<br />
'You'll soon learn English!' he said.<br />
I wonder, in England, each person speaks a different language.<br />
The English understand each other,<br />
&#xa0;but I don't understand them!<br />
Do they speak English?<br />
</p>
</div>
<div id="outline-container-org2d43f11" class="outline-3">
<h3 id="org2d43f11">expression</h3>
<div class="outline-text-3" id="text-org2d43f11">
<p>
railway [ˈreɪlweɪ] n.铁路<br />
porter [ˈpɔːtə(r)] n.搬运公<br />
several [ˈsevrəl] q. 几个<br />
foreigner [ˈfɒrənə(r)] n.外国人<br />
wonder [ˈwʌndə(r)] v.感到奇怪<br />
</p>

<p>
not know the way to sw. 不知道去某地的路<br />
</p>

<hr />
<ol class="org-ol">
<li>and,but,or,so,because(Because &amp; ,because): 连句子<br /></li>
<li>both&#x2026; and, either&#x2026;or,neither&#x2026;nor: 连两名词<br /></li>
<li>not only&#x2026; but also (as well) ?: 连句子<br /></li>
</ol>
</div>
</div>



<div id="outline-container-orgdc77d6d" class="outline-3">
<h3 id="orgdc77d6d">单词造句</h3>
</div>
<div id="outline-container-org834d74f" class="outline-3">
<h3 id="org834d74f">反复听电影片段</h3>
</div>
<div id="outline-container-org5ae474b" class="outline-3">
<h3 id="org5ae474b">Pattern Drill 写+读</h3>
</div>
<div id="outline-container-org586489f" class="outline-3">
<h3 id="org586489f">给自己讲解</h3>
</div>
<div id="outline-container-orgc73ef63" class="outline-3">
<h3 id="orgc73ef63">红皮书</h3>
</div>
<div id="outline-container-org09c7129" class="outline-3">
<h3 id="org09c7129">习惯用法造句</h3>
</div>
<div id="outline-container-orged14528" class="outline-3">
<h3 id="orged14528">跟读至背诵</h3>
</div>
<div id="outline-container-org3f6c4b7" class="outline-3">
<h3 id="org3f6c4b7">Ask me if 写+读</h3>
</div>
<div id="outline-container-orgb445ff7" class="outline-3">
<h3 id="orgb445ff7">摘要写作</h3>
</div>
<div id="outline-container-org24fad04" class="outline-3">
<h3 id="org24fad04">tell the story 口语</h3>
</div>
<div id="outline-container-org528788d" class="outline-3">
<h3 id="org528788d">Topics for discussion</h3>
</div>
</div>
</div>
</body>
</html>
